app/controllers/restos_controller.rb

  def index
    @restaurants = Resto.all
---
SELECT "restos".* FROM "restos"